---
kind: property
id: P:Autodesk.Revit.DB.LayoutRuleFixedNumber.NumberOfLines
source: html/fcb2e002-473e-2b05-78cc-c469918461c2.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedNumber.NumberOfLines Property

Get or set the number of the beams in a beam system.

## Syntax (C#)
```csharp
public int NumberOfLines { get; set; }
```

## Remarks
The number must be positive.